
#ifndef   __BSP_ACS712_H
#define   __BSP_ACS712_H

/*
*********************************************************************************************************
*                                              INCLUDE FILES
*********************************************************************************************************
*/

#include "includes.h"
#include "stm32f4xx.h"


/*
*********************************************************************************************************
*                                               DEFINES
*********************************************************************************************************
*/


// 使用的型号为5A量程

#define   ACS712_05B

// 因为该传感器速度很快所以对交流电要多次采样取得最大值，然后除以1.4142

#define   AC_SAMPLE_COUNT                       20               //对交流电的采样数       

// ADC的分辨率，与参考电压          

#define  ADC_RESOLUTION                         4096             // 在ADC驱动文件使用的是12位分辨率
#define  ADC_REFERENCE_VOL                      3300             // ADC参考电压单位mv


/*
*********************************************************************************************************
*                                      传感器相关的定义
*********************************************************************************************************
*/


// 5A量程

#if  defined(ACS712_05B)
#define    VOL_TO_CURRENT                       185              // 传感器指标，从电压到电流的转换系数单位为(mv/A)
#define    CURRENT_ZERO_POINT                   1304             // 电流为0时的电压输出，单位mv
#define    CURRENT_ZERO_ADC                     3103             // 电流为0时的ADC值，计算交流电是可以省去浮点运算
#endif  /* ACS712_05B */

// 20A量程

#if  defined(ACS712_20A)
#define    VOL_TO_CURRENT                       100              // 传感器指标，从电压到电流的转换系数单位为(mv/A)
#define    CURRENT_ZERO_POINT                   2500             // 电流为0时的电压输出，单位mv
#define    CURRENT_ZERO_ADC                     3103             // 电流为0时的ADC值，计算交流电是可以省去浮点运算
#endif  /* ACS712_20A */

// 30A量程

#if  defined(ACS712_30A)
#define    VOL_TO_CURRENT                       66               // 传感器指标，从电压到电流的转换系数单位为(mv/A)
#define    CURRENT_ZERO_POINT                   2500             // 电流为0时的电压输出，单位mv
#define    CURRENT_ZERO_ADC                     3103             // 电流为0时的ADC值，计算交流电是可以省去浮点运算
#endif  /* ACS712_30A */


/*
*********************************************************************************************************
*                                           FUNCTION PROTOTYPES
*********************************************************************************************************
*/

float      BSP_ACS_Get_AC(void);
float      BSP_ACS_GetS_Real(void);
float      BSP_ACS_GetU_Real(void);


#endif   /* __BSP_ACS712_H */



